TexasInstruments/mcupsdk-core/examples/drivers/gpadc/gpadc_temperature_sensor_read/awr294x-evm/r5fss0-0_nortos/example.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AWR294X" --package "ETS" --part "Default" --context "r5fss0-0" --product "MCU_PLUS_SDK@07.03.01"
 * @versions {"tool":"1.10.0+2127"}
 */

/**
 * Import the modules used in this configuration.
 */
const gpadc      = scripting.addModule("/drivers/gpadc/gpadc", {}, false);
const gpadc1     = gpadc.addInstance();
const clock      = scripting.addModule("/kernel/dpl/clock");
const debug_log  = scripting.addModule("/kernel/dpl/debug_log");
const dpl_cfg = scripting.addModule("/kernel/dpl/dpl_cfg");
const mpu_armv7  = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71 = mpu_armv7.addInstance();
const mpu_armv72 = mpu_armv7.addInstance();
const mpu_armv73 = mpu_armv7.addInstance();
const mpu_armv74 = mpu_armv7.addInstance();
const mpu_armv75 = mpu_armv7.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
gpadc1.$name                              = "CONFIG_GPADC0";
gpadc1.readMode                           = "TEMPERATURE";
gpadc1.gpadcChannel.create(3);
gpadc1.gpadcChannel[0].$name              = "CONFIG_GPADC_CH0";
gpadc1.gpadcChannel[0].isBufferedMode     = "TRUE";
gpadc1.gpadcChannel[0].useLuTable         = "FALSE";
gpadc1.gpadcChannel[1].$name              = "CONFIG_GPADC_CH1";
gpadc1.gpadcChannel[1].isBufferedMode     = "TRUE";
gpadc1.gpadcChannel[1].useLuTable         = "FALSE";
gpadc1.gpadcChannel[2].$name              = "CONFIG_GPADC_CH2";
gpadc1.gpadcChannel[2].isBufferedMode     = "TRUE";
gpadc1.gpadcChannel[2].useLuTable         = "FALSE";

debug_log.enableUartLog           = true;
debug_log.uartLog.$name           = "CONFIG_UART0";
debug_log.uartLog.UART.$assign    = "UARTA";
debug_log.uartLog.UART.RX.$assign = "ball.B16";
debug_log.uartLog.UART.TX.$assign = "ball.C16";

mpu_armv71.$name        = "CONFIG_MPU_REGION0";
mpu_armv71.attributes   = "Device";
mpu_armv71.allowExecute = false;

mpu_armv72.$name = "CONFIG_MPU_REGION1";
mpu_armv72.size  = 14;

mpu_armv73.$name    = "CONFIG_MPU_REGION2";
mpu_armv73.baseAddr = 0x80000;
mpu_armv73.size     = 14;

mpu_armv74.$name    = "CONFIG_MPU_REGION3";
mpu_armv74.baseAddr = 0x10200000;
mpu_armv74.size     = 20;

mpu_armv75.$name        = "CONFIG_MPU_REGION4";
mpu_armv75.baseAddr     = 0x102E0000;
mpu_armv75.size         = 16;
mpu_armv75.attributes   = "NonCached";
mpu_armv75.allowExecute = false;
